---
kind: other
id: Properties.T:Autodesk.Revit.DB.TextElementType
source: html/be651206-b4ad-8dfa-e611-ee9c9ef95e9d.htm
---
# TextElementType Properties

The id of the assembly instance to which the element belongs.